Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: MongoDB is a well known NoSQL Database that is widely used, but using its raw API can be cumbersome as you need to express your entities and your queries as a MongoDB link:{mongodb-doc-root-url}/bson/documents/#document[`Document`].
zh_cn: MongoDB是一个广为人知的NoSQL数据库，但使用其原始API可能很麻烦，因为你需要将你的实体和你的查询表达为MongoDB的 link:{mongodb-doc-root-url}/bson/documents/#document[`Document`] .

source: MongoDB is a well known NoSQL Database that is widely used.
zh_cn: MongoDB是一个众所周知的NoSQL数据库，被广泛使用。

source: MongoDB is a well known NoSQL Database that is widely used. MongoDB with Panache offers a new layer atop this familiar framework. This guide will not dive in to the specifics of either as those are already covered in the xref:mongodb-panache.adoc[MongoDB with Panache guide]. In this guide, we'll cover the Kotlin specific changes needed to use MongoDB with Panache in your Kotlin-based Quarkus applications.
zh_cn: MongoDB是一个众所周知的NoSQL数据库，被广泛使用。MongoDB与Panache在这个熟悉的框架之上提供了一个新的层次。本指南将不深入讨论这两者的具体细节，因为这些内容已经在 link:mongodb-panache.html[MongoDB with Panache指南] 中涵盖。在本指南中，我们将介绍在基于Kotlin的Quarkus应用程序中使用MongoDB with Panache所需的Kotlin特定变化。

source: MongoDB offers ACID transactions since version 4.0.
zh_cn: MongoDB从4.0版本开始提供ACID事务。

source: MongoDB queries are JSON based, so you will need some String manipulation or using the `Document` type and it will need a lot of boilerplate code.
zh_cn: MongoDB的查询是基于JSON的，所以你需要一些String操作或使用 `Document` 类型，它需要大量的模板代码。

source: MongoDB queries are super powerful, but overly verbose for common operations, requiring you to write queries even when you don't need all the parts.
zh_cn: MongoDB的查询功能超级强大，但对于普通操作来说过于冗长，即使不需要所有的部分，也需要你编写查询。

source: MongoDB queries must be valid JSON documents, using the same field multiple times in a query is not allowed using PanacheQL as it would generate an invalid JSON (see link:https://github.com/quarkusio/quarkus/issues/12086[this issue on github]).
zh_cn: MongoDB查询必须是有效的JSON文档，不允许使用 PanacheQL 在查询中多次使用同一字段，因为它将生成无效的JSON（见 link:https://github.com/quarkusio/quarkus/issues/12086[这个问题在github上] ）。

source: MongoDB with Panache allows using reactive style implementation for both entities and repositories. For this, you need to use the Reactive variants when defining your entities : `ReactivePanacheMongoEntity` or `ReactivePanacheMongoEntityBase`, and when defining your repositories: `ReactivePanacheMongoRepository` or `ReactivePanacheMongoRepositoryBase`.
zh_cn: 带有Panache的MongoDB允许对实体和存储库使用响应式实现。为此，你需要在定义实体时使用Reactive变形： `ReactivePanacheMongoEntity` 或 `ReactivePanacheMongoEntityBase` ，在定义存储库时使用： `ReactivePanacheMongoRepository` 或 `ReactivePanacheMongoRepositoryBase` 。

source: MongoDB with Panache also supports extended MongoDB queries by providing a `Document` query, this is supported by the find/list/stream/count/delete/update methods.
zh_cn: 带有Panache的MongoDB还支持扩展的MongoDB查询，提供了一个 `Document` 查询，这被find/list/stream/count/delete/update方法所支持。

source: MongoDB with Panache and Kotlin
zh_cn: 使用Panache和Kotlin的MongoDB

source: MongoDB with Panache offers operations to update multiple documents based on an update document and a query : `Person.update("foo = ?1, bar = ?2", fooName, barName).where("name = ?1", name)`.
zh_cn: 带有Panache的MongoDB提供了基于一个更新文档和一个查询的操作来更新多个文档： `Person.update("foo = ?1, bar = ?2", fooName, barName).where("name = ?1", name)` 。

source: MongoDB with Panache provides active record style entities (and repositories) like you have in xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] and focuses on making your entities trivial and fun to write in Quarkus.
zh_cn: 带有Panache的MongoDB提供了活跃的记录风格的实体（和存储库），就像你在 link:hibernate-orm-panache.html[带有Panache的Hibernate ORM] 中所拥有的那样，并专注于使你的实体在Quarkus中编写起来既简单又有趣。

source: MongoDB with Panache relies on compile-time bytecode enhancements to your entities.
zh_cn: 带有Panache的MongoDB依赖于对你的实体进行编译时的字节码增强。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/bson/pojos/[PojoCodecProvider] to convert your entities to a MongoDB `Document`.
zh_cn: 带有Panache的MongoDB使用 link:{mongodb-doc-root-url}/bson/pojos/[PojoCodecProvider] 将你的实体转换为MongoDB `Document` 。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider], a MongoDB codec which mandates the presence of a parameterless constructor.
zh_cn: 带有Panache的MongoDB使用 link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider] ，这是一个MongoDB编解码器，它强制要求存在一个无参数构造函数。

source: MongoDB with Panache uses the link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider], with link:{mongodb-doc-root-url}/pojos/#pojo-support[automatic POJO support], to automatically convert your object to a BSON document.
zh_cn: Panache的MongoDB使用 link:{mongodb-doc-root-url}/bson/pojos[PojoCodecProvider] ， link:{mongodb-doc-root-url}/pojos/#pojo-support[自动支持POJO] ，自动将你的对象转换为BSON文档。

source: More About Configuring Protected Resources
zh_cn: 关于配置受保护资源的更多信息

source: More Spring guides
zh_cn: 更多Spring指南

source: More details about Mutiny can be found in xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
zh_cn: 有关 Mutiny 的更多详细信息，请参见外部参考：xref:mutiny-primer.adoc[Mutiny - 一个直观的响应式编程库]。

source: More details about the AMQP Address model can be found in the https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[Artemis documentation].
zh_cn: 关于AMQP地址模型的更多详情，请参阅 link:https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[Artemis文档] 。

source: More details about the SmallRye Reactive Messaging configuration can be found in the https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/kafka/kafka.html[SmallRye Reactive Messaging - Kafka Connector Documentation].
zh_cn: 关于SmallRye Reactive Messaging配置的更多细节可以在 link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/kafka/kafka.html[SmallRye Reactive Messaging - Kafka Connector文档] 中找到。

source: More information about reflection in GraalVM can be found https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[here].
zh_cn: 关于GraalVM中反射的更多信息可以 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[在这里] 找到。

source: More information can be found in the link:building-native-image#testing-the-native-executable[Testing the native executable Guide].
zh_cn: 更多的信息可以在 link:building-native-image#testing-the-native-executable[Testing the native executable Guide] 里找到。

source: More information on how to use `Emitter` can be found in https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/emitter/emitter.html#_emitter_and_channel[SmallRye Reactive Messaging – Emitters and Channels]
zh_cn: 关于如何使用 `Emitter` ，可在 link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/emitter/emitter.html#_emitter_and_channel[SmallRye Reactive Messaging – Emitters and Channels] 中找到更多信息。

source: Most IDEs offer the possibility to run a selected class as a JUnit test directly. For this you should set a few properties in the settings of your chosen IDE:
zh_cn: 大多数IDE都提供了将选定的类直接作为JUnit测试运行的可能性。为了做到这点，您需要在您选择的IDE的设置中设置一些属性：

source: Most of our updates go out on <a href="https://twitter.com/quarkusio">Twitter</a>. Sometimes our project team speaks at industry events, and sometimes they post cool ways people use Quarkus. Wash, rinse, and retweet.
zh_cn: 我们的大部分更新都是在<a href="https://twitter.com/quarkusio">Twitter</a>上发布的。有时我们的项目团队会在行业活动中发言，有时他们会发布人们使用Quarkus的很酷的方法。欢迎一键三连，多多转发。

source: Most of the Quarkus tags are registered in the US link:https://nvd.nist.gov[National Vulnerability Database] (NVD) in Common Platform Enumeration (CPE) name format. To view the registered Quarkus CPE names, use link:https://nvd.nist.gov/products/cpe/search/results?namingFormat=2.3&keyword=quarkus[this search query].
zh_cn: 大多数Quarkus标签已经在美国 link:https://nvd.nist.gov[国家漏洞数据库] （NVD）中使用通用平台条目（Common Platform Enumeration，CPE）名称格式注册。所有注册的Quarkus CPE名称都可以通过 link:https://nvd.nist.gov/products/cpe/search/results?namingFormat=2.3&keyword=quarkus[这个搜索查询] 找到。

source: Most of the time you need to share the broker between applications. Dev Services for AMQP implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
zh_cn: 大多数情况下，你需要在应用程序之间共享代理。AMQP的开发服务为在 _开发_ 模式下运行的多个Quarkus应用程序实现了一个 _服务发现_ 机制，来共享一个代理。

source: Most of the time you need to share the broker between applications. Dev Services for Kafka implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
zh_cn: 大多数情况下，您需要在应用程序之间共享broker。Kafka的开发服务实现了一个 _服务发现(service discovery)_ 机制，可以让您的多个在 _开发_ 模式下运行的Quarkus应用程序共享一个broker。

source: Most of the time you need to share the registry between applications. Dev Services for Apicurio Registry implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single registry.
zh_cn: 大多数情况下，你需要在应用程序之间共享注册表。Apicurio注册表的开发服务为你在 _dev_ 模式下运行的多个Quarkus应用程序实现了一种 _service discovery_ 机制，以共享单个注册表。

source: Most of the time you need to share the server between applications. Dev Services for Redis implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
zh_cn: 很多时候你需要在多个应用之间共享Dev Services。Redis的Dev Services实现了 _服务发现_ 机制，允许多个以 _dev_ 模式运行的Quarkus应用共享同一个Dev Services。

source: Most useful operations
zh_cn: 最有用的操作

source: Mount the host's directory `target/native-image` to the container's `/work`. Thus, the generated binary will also be written to this directory.
zh_cn: 将主机的目录 `target/native-image` 挂载到容器的 `/work` 。因此，生成的二进制文件也将被写入这个目录。

source: Multi-Tenancy
zh_cn: 多租户

source: Multi-tenancy
zh_cn: 多租户

source: Multiple MongoDB Clients
zh_cn: 多个MongoDB客户端

source: Multiple Persistence Units
zh_cn: 多个持久化单元

source: Multiple Redis Clients
zh_cn: 多个Redis客户端

source: Multiple options may be separated by a comma. For example, one could use:
zh_cn: 多个选项可以用逗号隔开。例如，可以使用：

source: Multiple ways to connect with others via forum, stack, chat, or email groups.
zh_cn: 通过论坛、Stack、聊天或电子邮件组多种方式同我们保持联系。

source: Multiplier factor to determine maximum number of records queued for processing, using `max.poll.records` * `max-queue-size-factor`. Defaults to 2. In `batch` mode `max.poll.records` is considered `1`. Type: _int_
zh_cn: 用于决定队列中待处理的记录的最大值的乘数因子，使用 `max.poll.records` * `max-queue-size-factor` 来决定。默认为2。在 `batch` 模式下 `max.poll.records` 为 `1`。 类型: _int_

source: Mutiny - an intuitive and event-driven reactive programming library
zh_cn: Mutiny - 一个直观的事件驱动的响应式编程库

source: Mutual TLS (mTLS) authentication
zh_cn: TLS互认证

source: MySQL Client
zh_cn: MySQL客户端

source: NB: For Gradle project setup please see below, and for further reference consult the guide in the xref:gradle-tooling.adoc[Gradle setup page].
zh_cn: 注意：关于Gradle项目的设置，请见下文，如需进一步参考，请查阅 link:gradle-tooling.html[Gradle设置页面] 的指南。

source: NON-STANDARD FEATURES
zh_cn: 非标准功能

source: Name
zh_cn: 名称

source: Name of the cookie containing a token. This property will be effective only if `mp.jwt.token.header` is set to `Cookie`.
zh_cn: 包含令牌的cookie的名称。只有当 `mp.jwt.token.header` 被设置为 `Cookie` ，该属性才会有效。

source: Name of the cookie containing a token. This property will be effective only if `smallrye.jwt.token.header` is set to `Cookie`. This property is deprecated - use 'mp.jwt.token.cookie`.
zh_cn: 包含token的cookie的名称。该属性只有在 `smallrye.jwt.token.header` 被设置为 `Cookie` 时才有效。该属性已被废弃--请使用 `mp.jwt.token.cookie`。

source: Named Mongo client Injection
zh_cn: 以Mongo客户端的名字进行注入

source: Named Redis Client Injection
zh_cn: 注入有命名的Redis客户端

source: Named queries
zh_cn: 命名查询

source: Named queries can only be defined inside your JPA entity classes (being the Panache entity class, or the repository parameterized type), or on one of its super classes.
zh_cn: 命名查询只能在JPA实体类（必须是Panache实体类，或Repository类的参数化类型）内定义，或在它的父类中定义。

source: Narayana, as the underlying transaction manager, has a concept of a unique node identifier. This is important if you consider using XA transactions that involve multiple resources.
zh_cn: Narayana作为底层事务管理器，有一个唯一节点标识符的概念。如果你考虑使用涉及多个资源的XA事务，这就很重要了。

source: National Vulnerability Database
zh_cn: 国家安全漏洞数据库

source: Native
zh_cn: 原生

source: Native Executable Example
zh_cn: Native Executable的例子

source: Native Executable Testing
zh_cn: 本地可执行程序测试

source: Native Image Pre-Boot
zh_cn: 原生镜像预启动

source: Native Linux Transport
zh_cn: 本地Linux传输

source: Native MacOS Transport
zh_cn: 本地MacOS传输

source: Native Reference
zh_cn: 原生参考

source: Native Transport
zh_cn: 本地运输

source: Native executable compression
zh_cn: 原生可执行文件压缩

source: Native executable container image
zh_cn: 本地可执行的容器镜像

source: Native transports are not supported in GraalVM produced binaries.
zh_cn: GraalVM生产的二进制文件中不支持本地传输。

source: Need More Than Community Support?
zh_cn: 需要超出社区范围的支持?

source: Newsletter
zh_cn: 新闻

source: Next prepare your `application.properties`. You can start with a completely empty `application.properties` as `Dev Services for Keycloak` will register `quarkus.oidc.auth-server-url` pointing to the running test container as well as `quarkus.oidc.client-id=quarkus-app` and `quarkus.oidc.credentials.secret=secret`.
zh_cn: 接下来准备你的 `application.properties` 。你可以从一个完全空的 `application.properties` 开始，因为 `Keycloak开发服务` 将注册指向运行中的测试容器的 `quarkus.oidc.auth-server-url` ，以及 `quarkus.oidc.client-id=quarkus-app` 和 `quarkus.oidc.credentials.secret=secret` 。

source: Next you must copy some files from your GraalVM distribution into `src/main/zip.native/`.
zh_cn: 接下来，你必须将GraalVM发行版中的一些文件复制到 `src/main/zip.native/` 。

source: Next, configure the plugin as follows:
zh_cn: 您可以像这样配置该插件：

source: Next, while being in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] root folder execute:
zh_cn: 然后，在 link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] 的根目录下执行以下命令：

source: No
zh_cn: 不

source: No further action will be taken, and the tests will continue as normal (generally until CI times out), however the printed stack traces should help diagnose why the build has failed. You can control this timeout with the `quarkus.test.hang-detection-timeout` system property (you can also set this in application.properties, but this won't be read until Quarkus has started, so the timeout for Quarkus start will be the default of 10 minutes).
zh_cn: 不会有进一步的动作执行，测试将继续正常进行（通常直到CI超时），但是打印出来的堆栈信息应该有助于诊断为什么构建失败了。您可以用 `quarkus.test.hang-detection-timeout` 系统属性来控制这个超时值（您也可以在application.properties中设置这个值，但是在Quarkus启动之前它不会被读取，所以Quarkus启动的默认超时时间将是10分钟）。

source: No hassle native executable generation
zh_cn: 轻松生成本机可执行文件

source: No legumes there.
zh_cn: 那里没有legumes。

source: No, this is an old folk tale. Let's assume it essentially comes for free and let you scale to more complex cases involving several datasources as needed.
zh_cn: 不，这是一个古老的民间故事。让我们假设它基本上是免费的，让你根据需要扩展到涉及几个数据源的更复杂的情况。

source: Non-standard Features
zh_cn: 非标准功能

source: Nonetheless, setting this property is encouraged even if the endpoint does not require access to the remote introspection endpoint. The reasons behind it that `client-id`, if set, can be used to verify the token audience and will also be included in the logs when the token verification fails for the better traceability of the tokens issued to specific clients to be analyzed over a longer period of time.
zh_cn: 尽管如此，即使端点不需要访问远程自省端点，也鼓励设置该属性。其背后的原因是： `client-id` ，如果设置了这个属性，就可以用来验证令牌受众，当令牌验证失败时，也会包含在日志中，以便更好地追踪发放给特定客户的令牌，并在较长的时间内进行分析。

source: Normally, HQL queries are of this form: `from EntityName [where ...] [order by ...]`, with optional elements at the end.
zh_cn: 通常情况下，HQL查询语句是这种形式： `from EntityName [where ...​] [order by ...​]` ，结尾处有可选元素。

source: Normally, MongoDB queries are of this form: `{'firstname': 'John', 'lastname':'Doe'}`, this is what we call MongoDB native queries.
zh_cn: 通常情况下，MongoDB的查询是这种形式： `{'firstname': 'John', 'lastname':'Doe'}` ，这就是我们所说的MongoDB原生查询。

source: Note Quarkus `web-app` applications always require `quarkus.oidc.client-id` property.
zh_cn: 注意Quarkus `web-app` 应用程序总是需要 `quarkus.oidc.client-id` 属性。

source: Note for this code to work we need the content of the RSA private key that corresponds to the public key we have in the TokenSecuredResource application. Take the following PEM content and place it into `security-jwt-quickstart/src/test/resources/privateKey.pem`:
zh_cn: 注意为了使这段代码工作，我们需要RSA私钥的内容，它与我们在TokenSecuredResource应用程序中的公钥相对应。将以下PEM内容放入 `security-jwt-quickstart/src/test/resources/privateKey.pem` ：

source: Note how the AMQP broker location is configured. The `amqp.host` and `amqp.port` (`AMQP_HOST` and `AMQP_PORT` environment variables) properties configure location.
zh_cn: 注意AMQP代理的位置是如何配置的。 `amqp.host` 和 `amqp.port` ( `AMQP_HOST` 和 `AMQP_PORT` 环境变量) 属性配置位置。

source: Note it is also recommended to use `quarkus.oidc.token.audience` property to verify the token `aud` (`audience`) claim value.
zh_cn: 注意，建议使用 `quarkus.oidc.token.audience` 属性来验证令牌 `aud` ( `audience` )声明的值。

source: Note only the default tenant configuration applies when controlling anonymous access to the public resource is required.
zh_cn: 注意只有在需要控制公共资源的匿名访问时才适用默认租户配置。

source: Note that `@TestSecurity` `user` and `roles` attributes are available as `TokenIntrospection` `username` and `scope` properties and you can use `io.quarkus.test.security.oidc.TokenIntrospection` to add the additional introspection response properties such as an `email`, etc.
zh_cn: 请注意， `@TestSecurity` `user` 和 `roles` 属性可作为 `TokenIntrospection` `username` 和 `scope` 属性，你可以使用 `io.quarkus.test.security.oidc.TokenIntrospection` 来添加额外的自省响应属性，如 `email` ，等等。

source: Note that `@TestSecurity` annotation must always be used and its `user` property is returned as `JsonWebToken.getName()` and `roles` property - as `JsonWebToken.getGroups()`. `@JwtSecurity` annotation is optional and can be used to set the additional token claims.
zh_cn: 请注意，必须始终使用 `@TestSecurity` 注解，并且其 `user` 属性作为 `JsonWebToken.getName()` ， `roles` 属性-作为 `JsonWebToken.getGroups()` 。 `@JwtSecurity` 注释是可选的，可以用来设置额外的标记要求。

source: Note that `@TestSecurity` annotation must always be used and its `user` property is returned as `JsonWebToken.getName()` and `roles` property - as `JsonWebToken.getGroups()`. `@OidcSecurity` annotation is optional and can be used to set the additional token claims, as well as `UserInfo` and `OidcConfigurationMetadata` properties. Additionally, if `quarkus.oidc.token.issuer` property is configured then it will be used as an `OidcConfigurationMetadata` `issuer` property value.
zh_cn: 请注意，必须始终使用 `@TestSecurity` 注解，其 `user` 属性将作为 `JsonWebToken.getName()` 和 `roles` 属性-作为 `JsonWebToken.getGroups()` 。 `@OidcSecurity` 注解是可选的，可用于设置额外的标记要求，以及 `UserInfo` 和 `OidcConfigurationMetadata` 属性。此外，如果配置了 `quarkus.oidc.token.issuer` 属性，那么它将被用作 `OidcConfigurationMetadata` `issuer` 属性的值。

source: Note that `MyClassRequiringReflection` and `MySecondClassRequiringReflection` will be registered for reflection but not `MyReflectionConfiguration`.
zh_cn: 请注意， `MyClassRequiringReflection` 和 `MySecondClassRequiringReflection` 将被注册为反射，但不包括 `MyReflectionConfiguration` 。

source: Note that `io.quarkus.oidc.TokenIntrospection` (a simple `javax.json.JsonObject` wrapper) object will be created and can be either injected or accessed as a SecurityIdentity `introspection` attribute if either JWT or opaque token has been successfully introspected.
zh_cn: 请注意， `io.quarkus.oidc.TokenIntrospection` （一个简单的 `javax.json.JsonObject` 包装器）对象将被创建，如果JWT或不透明令牌已被成功自省，可以被注入或作为SecurityIdentity `introspection` 属性访问。

source: Note that a message processing failures nacks the message, which is then handled by the `failure-strategy`. It is the responsibility of the `failure-strategy` to report the failure and influence the outcome of the checks. The `fail` failure strategy reports the failure, and so the check will report the fault.
zh_cn: 请注意，消息处理失败会不认可消息，其然后由 `failure-strategy` 进行处理。报告失败并影响检查的结果是 `failure-strategy` 的责任。 `fail` 失败策略报告失败，因此检查将报告故障。

source: Note that at present this approach does not work with native image testing, as this would require the test alternatives to be baked into the native image.
zh_cn: 另外需要注意的是，目前这种方法不能用于本地镜像测试，因为这需要将测试用的alternatives加入本地镜像中。

source: Note that due to consumer rebalances, Kafka consumers only guarantee at-least-once processing of single records, meaning that uncommitted records _can_ be processed again by consumers.
zh_cn: 请注意，由于消费者之间的再平衡(rebalances)，Kafka消费者只保证对单一records的至少一次(at-least-once)处理，这意味着未提交的records _可以_ 被消费者再次处理。

source: Note that even numbers are added to the list, and odd numbers remove an element from the list.
zh_cn: 请注意，在这里偶数被添加到列表中，而到奇数时列表将删除一个元素。

source: Note that for production use the `transactional.id` must be unique across all application instances.
zh_cn: 请注意，要在生产环境使用，必须确保 `transactional.id` 在所有应用实例中是唯一的。

source: Note that in Reactive Messaging, the execution of processing methods, is already serialized, unless `@Blocking(ordered = false)` is used. If `withTransaction` can be called concurrently, for example from a REST endpoint, it is recommended to limit the concurrency of the execution. This can be done using the `@Bulkhead` annotation from link:https://quarkus.io/guides/smallrye-fault-tolerance[_Microprofile Fault Tolerance_].
zh_cn: 请注意，在 Reactive Messaging 中，处理方法的执行已经被序列化，除非使用了 `@Blocking(ordered = false)` 。 如果可以同时调用 `withTransaction` ，例如从 REST 节点，建议限制执行的并发性。 这可以使用后面链接中的 `@Bulkhead` 注释来完成：link:https://quarkus.io/guides/smallrye-fault-tolerance[_Microprofile Fault Tolerance_]。

source: Note that metrics appear lazily, you often won't see any data for your endpoint until something tries to access it, etc.
zh_cn: 请注意，metric是延迟出现的，您通常不会看到您的节点的任何数据，直到有请求试图访问它，等等。

source: Note that some Quarkus extensions are wrapping Vert.x clients and manage them for you. That's the case for the reactive data sources, Redis, mail... That's not the case with the Web Client.
zh_cn: 注意，部分 Quarkus 扩展正在封装 Vert.x 客户端并为您管理它们。如响应式数据源、Redis、邮件等... 但Web 客户端，并不在此行列之内。

source: Note that the Kafka advertised address is automatically configured with the chosen port.
zh_cn: 注意，Kafka的广告地址(advertised address)会自动配置为所选择的端口。

source: Note that the Kafka channels in SmallRye Reactive messaging are automatically configured with the chosen port.
zh_cn: 注意，SmallRye响应式消息中的Kafka通道会自动使用所选的端口进行配置。

source: Note that the OpenID Connect Provider externally accessible token and other endpoints may have different HTTP(S) URLs compared to the URLs auto-discovered or configured relative to `quarkus.oidc.auth-server-url` internal URL. For example, if your SPA acquires a token from an external token endpoint address and sends it to Quarkus as a Bearer token then an issuer verification failure may be reported by the endpoint.
zh_cn: 请注意，OpenID Connect Provider 外部可访问令牌和其他端点可能具有不同的 HTTP（S） URL，与相对于 `quarkus.oidc.auth-server-url` 内部 URL 自动发现或配置的 URL 相比。例如，如果您的 SPA 从外部令牌端点地址获取令牌并将其作为持有者令牌发送到 Quarkus，则端点可能会报告颁发者验证失败。

source: Note that the `acks` attribute has a huge impact on the record acknowledgement.
zh_cn: 请注意， `acks` 属性对记录的确认有巨大影响。

source: Note that the `generate` method returns a `Multi<Double>`, which implements the Reactive Streams `Publisher` interface. This publisher will be used by the framework to generate messages and send them to the configured Kafka topic.
zh_cn: 请注意， `generate` 方法返回了一个 `Multi<Double>` ，它实现了Reactive Streams `Publisher` 接口。Quarkus框架会使用这个发布者生成消息，并将其发送到您配置的Kafka topic中。
